[
  {
    "title": "Zyraa – Project Management & Team Collaboration Platform",
    "description": "Zyraa is a full-stack SaaS project management and team collaboration platform designed to streamline workflows, track progress, and automate team communication. It enables teams to manage sprint-based tasks with priority assignment, customizable workflows, drag-and-drop status tracking, integrated time monitoring, and secure document management. The platform features Slack integration for automated standups and channel synchronization, Stripe-powered subscription handling, AWS S3 file storage, and role-based access control with JWT authentication. Built with Node.js, Express, TypeScript, MongoDB, and React 18 (Vite + Tailwind CSS), Zyraa demonstrates expertise in scalable backend architecture, RESTful API development, cloud integration, SaaS billing systems, and modern interactive frontend design using Zustand, React DnD, and Tiptap.",
    "image": "/images/zyraa.png",
    "demo": "https://zyraa.net/"
  },
  {
    "title": "AI Resume Reviewer",
    "description": "AI Resume Reviewer is a full-stack web application that leverages advanced AI to analyze PDF resumes and provide actionable feedback. Users can upload their resumes, which are then processed using OpenAI’s GPT-4 to extract key sections like Skills, Experience, and Education. The app highlights potential gaps, suggests improvements, and compares extracted skills with industry recommendations. With a modern, responsive interface built on Next.js and Tailwind CSS, it delivers a seamless user experience. The backend, powered by Express.js and LangChain, orchestrates the AI workflow for accurate and insightful analysis. This tool empowers job seekers to optimize their resumes and boost their chances in the job market.",
    "image": "https://media.licdn.com/dms/image/v2/D5612AQHiyWWGuGLhFg/article-cover_image-shrink_720_1280/article-cover_image-shrink_720_1280/0/1733814700081?e=2147483647&v=beta&t=NQeMb2OoFxWjRCRgp8JYA8wc_06g_rYr7YDvV9zORIY",
    "github": "https://github.com/Muhammad-Ahtasham/AI-Resume-Reviewer.git",
    "demo": "https://ai-resume-reviewer1.netlify.app/",
    "video": "https://youtu.be/DwMdzo3OT6M"
  },
  {
    "title": "PDFQuery AI",
    "description": "Developed a full-stack AI-powered application that allows users to upload PDFs and interact with their content through natural language queries. Leveraging Large Language Models (LLMs) and Weaviate vector database, the system performs semantic search and context-based question answering over PDF documents. The key technologies used are MERN Stack (MongoDB, Express, React, Node.js) for the web interface and backend, Weaviate for vectorized document storage and semantic search, LangChain / OpenAI API (or relevant LLMs) for understanding and answering questions, PDF parsing and preprocessing for chunking and embedding generation. The Example use cases are Legal document Q&A, Research paper summarization, Internal knowledge base access. This project showcases my ability to integrate machine learning with scalable web technologies to build real-world AI solutions.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQS1zjvdWgyWKNb3UObU6o5awocQhr6frdOJQ&s",
    "github": "https://github.com/Muhammad-Ahtasham/PDF-CHATBOT.git",
    "demo": "https://pdfchatbot-qa.netlify.app/",
    "video": "https://youtu.be/jQVqS91-w4s"
  },
  {
    "title": "AI Image Generation",
    "description": "Using a pretrained model from hugging face, I trained it on my custom dataset (my own images). So the model used to take prompts and generate images based on the prompt",
    "image": "/images/project-ai-image-generation.jpg",
    "demo": "https://www.linkedin.com/posts/muhammadahtasham_artificialintelligence-lora-aienthusiast-activity-7089130698317438976-_EaG"
  },
  {
    "title": "Discord Chatbot Integration",
    "description": "Using OpenAI, I integrated a chatbot with discord.",
    "image": "/images/discord-bot.png",
    "demo": "https://www.linkedin.com/posts/muhammadahtasham_atiiigpt-openai-generativeai-activity-7103279000852004864-hf_C",
    "video": "https://youtu.be/iumA8HIP2do?si=44GSg2dFESUtb2SP"
  },
  {
    "title": "AI Based Alzheimer's Detection And Classification",
    "description": "Developed an innovative AI-powered system for early detection and classification of Alzheimer's disease. Leveraged machine learning algorithms and advanced neural networks to analyze brain imaging data, identifying subtle patterns indicative of the disease's onset. This project aimed to provide a non-invasive and efficient method for early diagnosis, potentially leading to better patient outcomes and enhanced treatment strategies. Collaborated with medical professionals to ensure clinical relevance and accuracy.",
    "image": "/images/project-alzheimers-detection.png",
    "demo": "https://www.linkedin.com/posts/muhammadahtasham_fyp-alzheimersdetection-teamwork-activity-7195501294457962496-Wwc6?utm_source=share&utm_medium=member_desktop&rcm=ACoAADbgXp4BG7KxPlptFGtM1RcbIFvbevtkFK4"
  },
  {
    "title": "Dalle Image Generator",
    "description": "This is a DALL·E-powered image generator web app. Enter a prompt to generate AI images, view your creations in the gallery, and download them for your use. Technologies Used are Python 3, Flask (web framework), OpenAI API (DALL·E 3), HTML, CSS, JavaScript (frontend). This app allows users to generate images using the DALL·E 3 model by OpenAI. Generated images are saved and can be viewed in the gallery. Users can download any image they create. The app is built with Flask for the backend and uses modern HTML/CSS/JS for the frontend.",
    "image": "https://raw.githubusercontent.com/Muhammad-Ahtasham/Dalle-Image-Generator/refs/heads/main/Generated%20Images/5aa80183beab4679b7f3494f376d5eea.png",
    "demo": "https://dalle-image-generator-kxb2.onrender.com/",
    "video": "https://youtu.be/-TbBT0_zs6Q?si=F_oCtxe13UV4btS_",
    "github": "https://github.com/Muhammad-Ahtasham/Dalle-Image-Generator"
  },
  {
    "title": "University Chatbot",
    "description": "I made this project during my internship. All the internees were asked to make a chatbot for their own universities. So first of all, I scrapped data from giki website and then made chatbot using langchain",
    "github": "https://github.com/Muhammad-Ahtasham/GIKI-chatbot-BF.git",
    "image": "https://edscoop.com/wp-content/uploads/sites/4/2021/05/GettyImages-936401434-1.jpg"
  },
  {
    "title": "DrugRecommender",
    "description": "The model took the symptoms as input from user and predicts the disease, recommend medicine and diet.",
    "github": "https://github.com/Muhammad-Ahtasham/DrugRecommender.git",
    "image": "https://miro.medium.com/v2/resize:fit:1400/1*Y0r18RDjLiMRGbZ2AfFRDg.jpeg"
  },
  {
    "title": "NeuroDev",
    "description": "I built the NeuroDev website using React.js, Next.js, and Tailwind CSS to create a fast, responsive, and modern web experience. The site was developed with a component-based architecture for reusability and scalability, while Next.js enabled server-side rendering and static generation for improved performance and SEO. Tailwind CSS allowed for rapid styling and consistent design across all screen sizes, and the site was deployed using Netlify, which handles continuous deployment and global CDN distribution. NeuroDev is a software services company that provides end-to-end digital solutions, including web development, UI/UX design, backend integration, and software consulting. The company focuses on helping startups and businesses bring their ideas to life through clean code, scalable architecture, and user-focused design, acting as a strategic technology partner in their digital transformation journey.",
    "demo": "https://neuro-dev.netlify.app/",
    "image": "/images/NeuroDev.png"
  }
]
